Revit 2027 API
RenderingSettings Properties
The RenderingSettings type exposes the following members.
Properties
Name | Description
BackgroundStyle |  The enum value that controls the background style for rendering.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LightingSource |  The lighting scheme type.
PrinterResolution |  The resolution level when using printer.
ResolutionTarget |  The resolution target.
ResolutionValue |  The rendering resolution in dots per inch (DPI).
UsesRegionRendering |  The bool value that indicates whether to use region rendering.
Top
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace